I was hitting this issue, when attempting to deploy into govcloud and settings `log_group_class` which is not supported.

```
  # module.dns_firewall.aws_cloudwatch_log_group.firewall[0] must be replaced
-/+ resource "aws_cloudwatch_log_group" "firewall" {
      ~ arn               = "arn:aws-us-gov:logs:us-gov-west-1:363534190981:log-group:ops-dev-01-dns-firewall" -> (known after apply)
      ~ id                = "ops-dev-01-dns-firewall" -> (known after apply)
      + log_group_class   = "STANDARD" # forces replacement
        name              = "ops-dev-01-dns-firewall"
      + name_prefix       = (known after apply)
        tags              = {
            "Name" = "ops-dev-01-dns-firewall"
        }
        # (4 unchanged attributes hidden)
    }
```

Removing that invalid `log_group_class` made the `+ name_prefix` stuff go away.